{
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "proj.0",
    "fc1",
    "key",
    "head.proj",
    "attn.proj",
    "value",
    "qkv",
    "dense",
    "proj.2",
    "query",
    "fc2"
  ],
  "task_type": "FEATURE_EXTRACTION"
}